The Odin Project/rails-practice/re-former/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "potato"], ["email", "p@e.c"], ["password", "potatosaresick"], ["created_at", "2020-06-18 20:40:16.995403"], ["updated_at", "2020-06-18 20:40:16.995403"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "sdfdasd"], ["updated_at", "2020-06-19 16:00:54.062754"], ["id", 3]]